{"--About Us--":[{"id":0,"text":"Students for Justice in Palestine at UNC-CH is a community of anti-Zionist and anti-racist Palestinians, Arabs, Muslims, Jews, and others, all committed to Palestinian liberation. We commonly affirm several points of unity, most especially Palestinians’ right to resist, return, and their right to self-determination. To pursue these goals inside the global heart of empire within the United States, we combat capitalism and imperialism within our local communities, calling on UNC-CH to divest from Israel and its genocidal and apartheid regime and challenging settler colonialism in all its forms. We are inspired by previous generations of student activists and organizers in North Carolina and the United States who have demanded liberation from occupied Turtle Island (otherwise known as the United States and Canada) to Palestine. As an organization, we educate community members, organize on behalf of Palestinian liberation, and stand in solidarity with Palestinians and one another in pursuit of our goals. "},{"id":1,"text":"Students for Justice in Palestine at UNC-CH is a community of anti-Zionist and anti-racist Palestinians, Arabs, Muslims, Jews, and others, all committed to Palestinian liberation. We commonly affirm several points of unity, most especially Palestinians’ right to resist, return, and their right to self-determination. To pursue these goals inside the global heart of empire within the United States, we combat capitalism and imperialism within our local communities, calling on UNC-CH to divest from Israel and its genocidal and apartheid regime and challenging settler colonialism in all its forms. We are inspired by previous generations of student activists and organizers in North Carolina and the United States who have demanded liberation from occupied Turtle Island (otherwise known as the United States and Canada) to Palestine. As an organization, we educate community members, organize on behalf of Palestinian liberation, and stand in solidarity with Palestinians and one another in pursuit of our goals. "}],"--Points of Unity--":[{"id":0,"header":"We are anti-Zionist.","text":"Zionism is a racist ideology that calls for the establishment of a Western settler colony in Palestine that privileges Jews at the expense of indigenous Palestinians, through mass ethnic cleansing and apartheid. We do not accept the legitimacy of Zionist ideology and will not make compromises to spare the feelings of Zionists. We completely reject the contention that Zionism is part of Jewish cultural or religious identity, and refuse to indulge the notion that anti-Zionism poses a threat to Jewish people."},{"id":1,"header":"We are anti-capitalist and anti-imperialist.","text":"We support the abolition of the imperial capitalist entity whose heart lies in amerikkka. Imperialism is the highest stage of capitalism. It entails a powerful hegemon viciously exploiting less powerful countries for their resources. We understand that the US is at the head of the most powerful empire in the world, and that the State of Israel is its foothold in the SWANA region. We reject the myth that Israel controls the US government to the detriment of Americans; in reality, Israel is an American client state and its existence benefits Americans as much as any other part of the empire does."},{"id":2,"header":"We are anti-racist and reject all forms of bigotry.","text":"Racism is pervasive, embedded in systems of power, and upholds all forms of oppression. To be anti-racist, we commit to actively identifying, challenging, and dismantling racism and oppression in ourselves, our community, and institutions. This includes: Educating ourselves on systemic racism, implicit bias, and historical roots of oppression; Centering and amplifying the voices of the most marginalized in our community, and; Interrupting harmful behaviors and inequitable structures - both internal and external to the organization - even when uncomfortable. Anti-racism requires ongoing action. When we fall short, we commit to accountability through repair, transparency, and continuous growth."}],"--SJP On Campus--":[{"id":0,"date":{"day":"ipsum lorem","month":"dolum emet","year":"ipsum lorem"},"title":"dolum emet ","rationale":"ipsum lorem","outcome":"dolum emet","photos":[{"url":"ipsum lorem","description":"dolum emet"},{"url":"ipsum lorem","description":"dolum emet"}]},{"id":1,"date":{"day":"ipsum lorem","month":"dolum emet","year":"ipsum lorem"},"title":"dolum emet ","rationale":"ipsum lorem","outcome":"dolum emet","photos":[{"url":"ipsum lorem","description":"dolum emet"},{"url":"ipsum lorem","description":"dolum emet"}]},{"id":2,"date":{"day":"ipsum lorem","month":"dolum emet","year":"ipsum lorem"},"title":"dolum emet","rationale":"ipsum lorem","outcome":"dolum emet","photos":[{"url":"ipsum lorem","description":"dolum emet"},{"url":"ipsum lorem","description":"dolum emet"}]},{"id":3,"date":{"day":"ipsum lorem","month":"dolum emet","year":"ipsum lorem"},"title":"dolum emet","rationale":"ipsum lorem","outcome":"dolum emet","photos":[{"url":"ipsum lorem","description":"dolum emet"},{"url":"ipsum lorem","description":"dolum emet"}]}]}