{"--About Us--":[{"id":0,"text":"Students for Justice in Palestine at UNC-CH is a community of anti-Zionist and anti-racist Palestinians, Arabs, Muslims, Jews, and others, all committed to Palestinian liberation. We commonly affirm several points of unity, most especially Palestinians’ right to resist, return, and their right to self-determination. To pursue these goals inside the global heart of empire within the United States, we combat capitalism and imperialism within our local communities, calling on UNC-CH to divest from Israel and its genocidal and apartheid regime and challenging settler colonialism in all its forms. We are inspired by previous generations of student activists and organizers in North Carolina and the United States who have demanded liberation from occupied Turtle Island (otherwise known as the United States and Canada) to Palestine. As an organization, we educate community members, organize on behalf of Palestinian liberation, and stand in solidarity with Palestinians and one another in pursuit of our goals."}],"--Points of Unity--":[{"id":0,"header":"We are anti-Zionist.","text":"Zionism is a racist ideology that calls for the establishment of a Western settler colony in Palestine that privileges Jews at the expense of indigenous Palestinians, through mass ethnic cleansing and apartheid. We do not accept the legitimacy of Zionist ideology and will not make compromises to spare the feelings of Zionists. We completely reject the contention that Zionism is part of Jewish cultural or religious identity, and refuse to indulge the notion that anti-Zionism poses a threat to Jewish people."},{"id":1,"header":"We are anti-capitalist and anti-imperialist.","text":"We support the abolition of the imperial capitalist entity whose heart lies in amerikkka. Imperialism is the highest stage of capitalism. It entails a powerful hegemon viciously exploiting less powerful countries for their resources. We understand that the US is at the head of the most powerful empire in the world, and that the State of Israel is its foothold in the SWANA region. We reject the myth that Israel controls the US government to the detriment of Americans; in reality, Israel is an American client state and its existence benefits Americans as much as any other part of the empire does."},{"id":2,"header":"We are anti-racist and reject all forms of bigotry.","text":"Racism is pervasive, embedded in systems of power, and upholds all forms of oppression. To be anti-racist, we commit to actively identifying, challenging, and dismantling racism and oppression in ourselves, our community, and institutions. This includes: Educating ourselves on systemic racism, implicit bias, and historical roots of oppression; Centering and amplifying the voices of the most marginalized in our community, and; Interrupting harmful behaviors and inequitable structures - both internal and external to the organization - even when uncomfortable. Anti-racism requires ongoing action. When we fall short, we commit to accountability through repair, transparency, and continuous growth."}],"--SJP On Campus--":[{"id":0,"date":{"day":"12","month":"October","year":"2023"},"title":"Day of Resistance Protest in front of Wilson Library","rationale":"Organized to support the nationwide Day of Resistance as called for by National SJP, and to commemorate the Gaza Ghetto Uprising.","outcome":"UNC SJP’s first major on-campus event since October 7th, 2023, as part of a nationwide Day of Resistance called for by National SJP, was a protest held in front of Wilson Library. Coinciding with UNC’s 230th University Day anniversary ceremony, 80+ pro-Palestinian protesters assembled and organizers gaves speeches on the steps of the library. Fifteen minutes into the demonstration, 20+ pro-Israel counterprotesters approached the demonstration, causing tensions to rise. UNC Religious Studies professor Evyatar Marienberg, in support of the pro-Israel counterprotestors, got confrontational with the pro-Palestinian protesters, crossed into the demonstration and raised the Israeli flag, and called the pro-Palestinian protestors “Nazis.”","photos":[{"url":"ipsum lorem","description":"dolum emet"},{"url":"ipsum lorem","description":"dolum emet"}]},{"id":1,"date":{"day":"27","month":"October","year":"2023"},"title":"Week of Action + Sit-in outside of South Building","rationale":"Organized in response to the call by various Palestinian groups and in order to raise awareness among students at UNC.","outcome":"On the fifth and last day of a Week of Action (10/23-10/27), SJP held a sit-in in front of South Building. 100+ attendees occupied the space outside the Building, speakers gave speeches, and UNC SJP delivered an Open Letter to Admin demanding that UNC boycott and divest from Israel. Previous events that week included tabling on the Quad (Monday); a live conversation call with Palestinians in the West Bank (Tuesday); a walkout from class at Duke’s Able Quad, as per a national walkout call (Wednesday); and a panel-based discussion about the war on Gaza (Thursday).","photos":[{"url":"ipsum lorem","description":"dolum emet"},{"url":"ipsum lorem","description":"dolum emet"}]},{"id":2,"date":{"day":"4","month":"November","year":"2023"},"title":"National March on Washington: Free Palestine","rationale":"UNC SJP strongly supported the march, and organized many of our members to attend.","outcome":"The first pro-Palestine National March on Washington since Oct. 7, 2023, demanding the end of U.S. aid to Israel and lifting the Israeli siege on Gaza. The march attracted thousands of supporters and was organized by many groups including ANSWER, The People’s Forum, Palestinian Youth Movement, etc. and co-endorsed by UNC SJP, National SJP, etc. ","photos":[{"url":"ipsum lorem","description":"dolum emet"},{"url":"ipsum lorem","description":"dolum emet"}]},{"id":3,"date":{"day":"17","month":"November ","year":"2023"},"title":"March on and Sit-in inside South Building","rationale":"Organized with the ShutItDown4Palestine campaign, and in response to complete blanking from the university administration with regards to our demands.","outcome":"UNC SJP led a march from Wilson Library to South Building. The march was co-endorsed by 19 other organizations. At the end of the march, about 40 demonstrators occupied and sat-in South Building for 3+ hours chanting, shutting down administrative operations for the day, and conveying the urgency of our divestment demands to Admin.","photos":[{"url":"","description":""},{"url":"","description":""}]},{"id":4,"date":{"day":"22","month":"January ","year":"2024"},"title":"Walkout of fascist Bari Weiss’s Program for Public Discourse Event","rationale":"As part of the Abbey Speaker Series, right-wing U.S. political commentator and rampant Zionist Bari Weiss was hosted in the UNC Student Union Auditorium. Weiss is infamous for spending her career egregiously attempting to conflate anti-Zionism with antisemitism, while reviling intersectionality, pro-Palestinian voices, and any critique of the settler state of Israel. ","outcome":"Zionists and Zionist groups on campus were unsettled by the direct confrontation with one of their leading voices. Statewide Zionist groups, also present at the talk, worked and failed to dox members of SJP who walked out. Speech First, a right-wing national group, attempted to pressure the administration to further punish students. Several outlets have pieces online about the event, which mostly fret over the legality and 'rightness' of the protest, rather than the ethics and ideology of leigitmizing Bari Weiss' discourse.","photos":[{"url":"","description":""},{"url":"","description":""}]},{"id":5,"date":{"day":"26","month":"January","year":"2024"},"title":"Fly for a Free Palestine","rationale":"To center joy, resistance, and Palestinian liberation, UNC SJP organized a kite flying event on UNC’s Quad in front of South Building. ","outcome":"The event was children- and family-friendly, and attendees made art, ink prints, crafts, while also flying kites and sending banners into the air. The event honored the Palestinian tradition of kite-flying as a form of radical joy and resistance, exemplified by the 2011 world record for kite-flying set by 12K+ Gazan children, Burin Kite Festival, and Palestinian author Dr. Refaat Alareer’s poem “If I Must Die.”","photos":[{"url":"","description":""},{"url":"","description":""}]}]}